app/controllers/largesurveys_controller.rb

SELECT "largesurveys".* FROM "largesurveys"
---
  def index
    @largesurveys = Largesurvey.all

INSERT INTO "largesurveys" ("created_at", "name", "review", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @largesurvey = Largesurvey.new(largesurvey_params)

    respond_to do |format|
      if @largesurvey.save